
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//** Кравченко 17.02.26 Добавление команды перерасчета с учетом скидки
	
	Если Элементы.Найти("КомандаПерерасчета") = Неопределено Тогда
		//Создание команды
		КомандаПерерасчета = Команды.Добавить("Пересчитать");
		КомандаПерерасчета.Заголовок = "Пересчитать с учетом скидки";
		КомандаПерерасчета.Действие = "КомандаПерерасчета"; 
		
		КнопкаПерерасчета = Элементы.Добавить("КомандаПерерасчета", Тип("КнопкаФормы"), Элементы.ГруппаСкидки);
		КнопкаПерерасчета.ИмяКоманды = "Пересчитать";
		КнопкаПерерасчета.Заголовок = "Пересчитать с учетом скидки";
		КнопкаПерерасчета.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Элементы.СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	
	//-- Кравченко 17.02.26 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	
	//**Кравченко 17.02.26
	Cкидка = Объект.ИЗМ_СогласованнаяСкидка + ТекущиеДанные.Скидка;
	Если Cкидка > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Скидка не может быть больше 100%");
		Сообщение.Сообщить();
		ТекущиеДанные.Сумма = 0;
		Возврат;
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * (1 - Cкидка / 100);
	КонецЕсли;
	// --Кравченко 17.02.26
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерерасчета()
	
	//** Кравченко 17.02.26 Команда перерасчета с учетом скидки
	Товары = Объект.Товары;
	Услуги = Объект.Услуги;
	
	ПерерасчетТабличнойЧасти(Товары);
	ПерерасчетТабличнойЧасти(Услуги);
    //-- Кравченко 17.02.26 
КонецПроцедуры 

&НаКлиенте
Процедура ПерерасчетТабличнойЧасти(ТабличнаяЧасть)
	
	//** Кравченко 17.02.26 Команда перерасчета с учетом скидки

	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		РассчитатьСуммуСтроки(Строка);	
		
	КонецЦикла;
   //-- Кравченко 17.02.26 
КонецПроцедуры	

&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении(Элемент)
	
	//** Кравченко 17.02.26
	
	Если Объект.Товары.Количество() <> 0 
		И Объект.Услуги.Количество() <> 0 Тогда 
		
		Ответ = Ждать ВопросАсинх("Пересчитать табличную часть?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Товары = Объект.Товары;
		Услуги = Объект.Услуги;
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ПерерасчетТабличнойЧасти(Товары);
			
			ПерерасчетТабличнойЧасти(Услуги);
			
		КонецЕсли;
	КонецЕсли;	
		
		//-- Кравченко 17.02.26
		
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
