#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Договор,  
		|Комментарий,
		|Контрагент,
		|Ссылка,
		|Организация,
		|Ответственный,
		|Товары");
		ТаблицаТовары = ЗначениеРеквизитов.Товары.Выгрузить();
		// Заполнение шапки
		Договор = ЗначениеРеквизитов.Договор;
		Комментарий = ЗначениеРеквизитов.Комментарий;
		Контрагент = ЗначениеРеквизитов.Контрагент;
		Организация = ЗначениеРеквизитов.Организация;
		Основание = ЗначениеРеквизитов.Ссылка;
		Ответственный = ЗначениеРеквизитов.Ответственный;
		//Заполнение Табличной части
		Для Каждого Строка Из ТаблицаТовары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
